Revit 2027 API
PipeScheduleType.Create Method
 Creates a new pipe schedule type with the given name.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static PipeScheduleType Create(
	Document doc,
	string name
)
Public Shared Function Create (
	doc As Document,
	name As String
) As PipeScheduleType
public:
static PipeScheduleType^ Create(
	Document^ doc,
	String^ name
)
static member Create :
        doc : Document *
        name : string -> PipeScheduleType
Parameters
doc Document
 The document
name String
 The name of requested schedule type.
Return Value
PipeScheduleType
 Returns the newly created schedule type.
Exceptions
Exception | Condition
ArgumentException |  name is an empty string.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The name is already taken by an existing pipe schedule type.
Remarks
 If the name is already taken by an existing schedule type, an InvalidOperationException will be thrown.
See Also
Reference
PipeScheduleType Class
Autodesk.Revit.DB.Plumbing Namespace